expriment/fio/512.log
pmem-r-random-0: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-20: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-40: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-60: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-80: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-100: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-0: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-20: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-40: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-60: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-80: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-100: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
fio-3.12
Starting 12 processes

pmem-r-random-0: (groupid=0, jobs=1): err= 0: pid=25994: Sat Jul  3 21:30:40 2021
  read: IOPS=611k, BW=298MiB/s (313MB/s)(8192MiB/27449msec)
    clat (nsec): min=302, max=201935, avg=1414.45, stdev=2986.10
     lat (nsec): min=328, max=201963, avg=1441.28, stdev=2986.20
    clat percentiles (nsec):
     |  1.00th=[  326],  5.00th=[  330], 10.00th=[  334], 20.00th=[  338],
     | 30.00th=[  354], 40.00th=[  374], 50.00th=[  378], 60.00th=[  406],
     | 70.00th=[  446], 80.00th=[  506], 90.00th=[ 5024], 95.00th=[ 9408],
     | 99.00th=[13632], 99.50th=[15168], 99.90th=[18560], 99.95th=[19840],
     | 99.99th=[24192]
   bw (  KiB/s): min=241830, max=508278, per=29.21%, avg=305632.07, stdev=69509.54, samples=54
   iops        : min=483660, max=1016556, avg=611264.35, stdev=139019.08, samples=54
  lat (nsec)   : 500=79.61%, 750=7.11%, 1000=0.64%
  lat (usec)   : 2=0.10%, 4=1.74%, 10=6.46%, 20=4.29%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=19.73%, sys=80.27%, ctx=51, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-20: (groupid=0, jobs=1): err= 0: pid=25995: Sat Jul  3 21:30:40 2021
  read: IOPS=442k, BW=216MiB/s (227MB/s)(8192MiB/37915msec)
    clat (nsec): min=312, max=263032, avg=1869.64, stdev=4249.60
     lat (nsec): min=338, max=263058, avg=1896.61, stdev=4249.66
    clat percentiles (nsec):
     |  1.00th=[  330],  5.00th=[  334], 10.00th=[  338], 20.00th=[  350],
     | 30.00th=[  378], 40.00th=[  394], 50.00th=[  442], 60.00th=[  482],
     | 70.00th=[  612], 80.00th=[  844], 90.00th=[ 6624], 95.00th=[12096],
     | 99.00th=[20096], 99.50th=[23168], 99.90th=[31616], 99.95th=[36096],
     | 99.99th=[49408]
   bw (  KiB/s): min=106060, max=491670, per=22.02%, avg=230419.35, stdev=113842.21, samples=71
   iops        : min=212120, max=983340, avg=460838.76, stdev=227684.46, samples=71
  lat (nsec)   : 500=61.89%, 750=13.01%, 1000=9.65%
  lat (usec)   : 2=3.42%, 4=0.59%, 10=4.60%, 20=5.86%, 50=0.99%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=15.74%, sys=84.23%, ctx=76, majf=0, minf=1605
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-40: (groupid=0, jobs=1): err= 0: pid=25996: Sat Jul  3 21:30:40 2021
  read: IOPS=381k, BW=186MiB/s (195MB/s)(8192MiB/44026msec)
    clat (nsec): min=313, max=874257, avg=2122.96, stdev=4270.61
     lat (nsec): min=339, max=874283, avg=2149.87, stdev=4270.66
    clat percentiles (nsec):
     |  1.00th=[  330],  5.00th=[  338], 10.00th=[  342], 20.00th=[  382],
     | 30.00th=[  430], 40.00th=[  470], 50.00th=[  556], 60.00th=[  764],
     | 70.00th=[  844], 80.00th=[  988], 90.00th=[ 8384], 95.00th=[13120],
     | 99.00th=[19328], 99.50th=[21376], 99.90th=[25216], 99.95th=[26752],
     | 99.99th=[31872]
   bw (  KiB/s): min=  143, max=473681, per=19.53%, avg=204296.65, stdev=134230.23, samples=82
   iops        : min=  286, max=947360, avg=408593.34, stdev=268460.45, samples=82
  lat (nsec)   : 500=45.42%, 750=13.28%, 1000=21.66%
  lat (usec)   : 2=6.07%, 4=0.58%, 10=4.94%, 20=7.21%, 50=0.83%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=14.75%, sys=85.21%, ctx=102, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-60: (groupid=0, jobs=1): err= 0: pid=25997: Sat Jul  3 21:30:40 2021
  read: IOPS=355k, BW=173MiB/s (182MB/s)(8192MiB/47276msec)
    clat (nsec): min=316, max=674891, avg=2390.46, stdev=4834.99
     lat (nsec): min=342, max=674917, avg=2417.43, stdev=4835.03
    clat percentiles (nsec):
     |  1.00th=[  338],  5.00th=[  346], 10.00th=[  390], 20.00th=[  454],
     | 30.00th=[  516], 40.00th=[  716], 50.00th=[  772], 60.00th=[  820],
     | 70.00th=[  892], 80.00th=[ 1048], 90.00th=[ 9024], 95.00th=[13888],
     | 99.00th=[22400], 99.50th=[25728], 99.90th=[34048], 99.95th=[38656],
     | 99.99th=[52480]
   bw (  KiB/s): min=29702, max=474796, per=17.34%, avg=181443.93, stdev=136448.23, samples=91
   iops        : min=59404, max=949592, avg=362887.95, stdev=272896.51, samples=91
  lat (nsec)   : 500=28.83%, 750=16.14%, 1000=32.73%
  lat (usec)   : 2=8.15%, 4=0.66%, 10=4.73%, 20=7.08%, 50=1.67%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=14.73%, sys=85.25%, ctx=92, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-80: (groupid=0, jobs=1): err= 0: pid=25998: Sat Jul  3 21:30:40 2021
  read: IOPS=349k, BW=170MiB/s (179MB/s)(8192MiB/48110msec)
    clat (nsec): min=319, max=943688, avg=2329.09, stdev=4329.41
     lat (nsec): min=346, max=943714, avg=2355.97, stdev=4329.46
    clat percentiles (nsec):
     |  1.00th=[  346],  5.00th=[  430], 10.00th=[  470], 20.00th=[  676],
     | 30.00th=[  740], 40.00th=[  772], 50.00th=[  804], 60.00th=[  844],
     | 70.00th=[  916], 80.00th=[ 1064], 90.00th=[ 8768], 95.00th=[13504],
     | 99.00th=[19840], 99.50th=[21632], 99.90th=[25728], 99.95th=[27264],
     | 99.99th=[32384]
   bw (  KiB/s): min=38303, max=480080, per=17.90%, avg=187304.09, stdev=149910.59, samples=89
   iops        : min=76606, max=960160, avg=374608.03, stdev=299820.92, samples=89
  lat (nsec)   : 500=13.49%, 750=20.20%, 1000=42.66%
  lat (usec)   : 2=9.70%, 4=0.76%, 10=4.76%, 20=7.51%, 50=0.92%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=15.00%, sys=84.97%, ctx=112, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-100: (groupid=0, jobs=1): err= 0: pid=25999: Sat Jul  3 21:30:40 2021
  read: IOPS=362k, BW=177MiB/s (185MB/s)(8192MiB/46381msec)
    clat (nsec): min=331, max=607584, avg=2304.02, stdev=4155.68
     lat (nsec): min=358, max=607611, avg=2330.90, stdev=4155.75
    clat percentiles (nsec):
     |  1.00th=[  588],  5.00th=[  676], 10.00th=[  708], 20.00th=[  740],
     | 30.00th=[  764], 40.00th=[  788], 50.00th=[  820], 60.00th=[  860],
     | 70.00th=[  932], 80.00th=[ 1080], 90.00th=[ 7904], 95.00th=[12992],
     | 99.00th=[19328], 99.50th=[21376], 99.90th=[25472], 99.95th=[27264],
     | 99.99th=[34560]
   bw (  KiB/s): min=37900, max=462493, per=17.81%, avg=186364.77, stdev=150187.62, samples=88
   iops        : min=75800, max=924986, avg=372729.63, stdev=300375.30, samples=88
  lat (nsec)   : 500=0.27%, 750=23.75%, 1000=51.10%
  lat (usec)   : 2=11.03%, 4=0.82%, 10=5.27%, 20=6.97%, 50=0.81%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=15.76%, sys=84.22%, ctx=147, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16777216,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-0: (groupid=0, jobs=1): err= 0: pid=26000: Sat Jul  3 21:30:40 2021
  write: IOPS=302k, BW=147MiB/s (155MB/s)(8192MiB/55553msec); 0 zone resets
    clat (nsec): min=586, max=33345k, avg=3009.41, stdev=99081.64
     lat (nsec): min=617, max=33345k, avg=3042.84, stdev=99081.65
    clat percentiles (nsec):
     |  1.00th=[  612],  5.00th=[  652], 10.00th=[  668], 20.00th=[  740],
     | 30.00th=[  900], 40.00th=[ 1112], 50.00th=[ 1384], 60.00th=[ 1752],
     | 70.00th=[ 2256], 80.00th=[ 2992], 90.00th=[ 6176], 95.00th=[ 9920],
     | 99.00th=[15040], 99.50th=[16512], 99.90th=[20096], 99.95th=[21632],
     | 99.99th=[28288]
   bw (  KiB/s): min=57624, max=329820, per=32.97%, avg=152415.85, stdev=46026.94, samples=110
   iops        : min=115248, max=659642, avg=304831.85, stdev=92053.98, samples=110
  lat (nsec)   : 750=20.99%, 1000=13.62%
  lat (usec)   : 2=30.67%, 4=21.00%, 10=8.84%, 20=4.78%, 50=0.10%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=10.92%, sys=73.86%, ctx=543, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-20: (groupid=0, jobs=1): err= 0: pid=26001: Sat Jul  3 21:30:40 2021
  write: IOPS=204k, BW=99.8MiB/s (105MB/s)(8192MiB/82062msec); 0 zone resets
    clat (nsec): min=596, max=383872k, avg=4384.90, stdev=168884.54
     lat (nsec): min=627, max=383872k, avg=4418.84, stdev=168884.57
    clat percentiles (nsec):
     |  1.00th=[  644],  5.00th=[  804], 10.00th=[  956], 20.00th=[ 1256],
     | 30.00th=[ 1544], 40.00th=[ 1832], 50.00th=[ 2160], 60.00th=[ 2512],
     | 70.00th=[ 2960], 80.00th=[ 3824], 90.00th=[ 9024], 95.00th=[12352],
     | 99.00th=[18816], 99.50th=[20864], 99.90th=[24704], 99.95th=[26496],
     | 99.99th=[35072]
   bw (  KiB/s): min=39939, max=177505, per=23.09%, avg=106722.34, stdev=28366.57, samples=157
   iops        : min=79878, max=355008, avg=213444.63, stdev=56733.18, samples=157
  lat (nsec)   : 750=3.79%, 1000=7.88%
  lat (usec)   : 2=33.82%, 4=35.57%, 10=10.81%, 20=7.47%, 50=0.66%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=8.38%, sys=73.51%, ctx=864, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-40: (groupid=0, jobs=1): err= 0: pid=26002: Sat Jul  3 21:30:40 2021
  write: IOPS=172k, BW=84.1MiB/s (88.1MB/s)(8192MiB/97446msec); 0 zone resets
    clat (nsec): min=598, max=363901k, avg=5245.09, stdev=227115.29
     lat (nsec): min=629, max=363901k, avg=5282.17, stdev=227115.28
    clat percentiles (nsec):
     |  1.00th=[  788],  5.00th=[  980], 10.00th=[ 1128], 20.00th=[ 1368],
     | 30.00th=[ 1576], 40.00th=[ 1784], 50.00th=[ 2008], 60.00th=[ 2288],
     | 70.00th=[ 2640], 80.00th=[ 3248], 90.00th=[ 8512], 95.00th=[12480],
     | 99.00th=[18560], 99.50th=[20608], 99.90th=[24960], 99.95th=[26752],
     | 99.99th=[45824]
   bw (  KiB/s): min=27276, max=161285, per=19.24%, avg=88939.19, stdev=30470.97, samples=187
   iops        : min=54552, max=322568, avg=177878.32, stdev=60941.90, samples=187
  lat (nsec)   : 750=0.74%, 1000=4.81%
  lat (usec)   : 2=44.14%, 4=34.79%, 10=7.68%, 20=7.21%, 50=0.62%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=8.23%, sys=58.45%, ctx=1717, majf=0, minf=1074
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-60: (groupid=0, jobs=1): err= 0: pid=26003: Sat Jul  3 21:30:40 2021
  write: IOPS=162k, BW=79.1MiB/s (82.0MB/s)(8192MiB/103512msec); 0 zone resets
    clat (nsec): min=592, max=369906k, avg=5572.23, stdev=234613.10
     lat (nsec): min=625, max=369906k, avg=5609.40, stdev=234613.10
    clat percentiles (nsec):
     |  1.00th=[  876],  5.00th=[ 1080], 10.00th=[ 1224], 20.00th=[ 1464],
     | 30.00th=[ 1656], 40.00th=[ 1848], 50.00th=[ 2064], 60.00th=[ 2320],
     | 70.00th=[ 2704], 80.00th=[ 3376], 90.00th=[ 9024], 95.00th=[13120],
     | 99.00th=[19328], 99.50th=[21376], 99.90th=[25472], 99.95th=[27264],
     | 99.99th=[56064]
   bw (  KiB/s): min=21071, max=256143, per=18.14%, avg=83852.77, stdev=45415.86, samples=200
   iops        : min=42142, max=512284, avg=167705.51, stdev=90831.68, samples=200
  lat (nsec)   : 750=0.26%, 1000=2.76%
  lat (usec)   : 2=44.10%, 4=36.46%, 10=7.79%, 20=7.86%, 50=0.77%
  lat (usec)   : 100=0.01%, 250=0.01%, 750=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=8.30%, sys=57.72%, ctx=1762, majf=0, minf=1074
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-80: (groupid=0, jobs=1): err= 0: pid=26004: Sat Jul  3 21:30:40 2021
  write: IOPS=157k, BW=76.5MiB/s (80.2MB/s)(8192MiB/107110msec); 0 zone resets
    clat (nsec): min=597, max=383881k, avg=5753.37, stdev=239554.23
     lat (nsec): min=628, max=383881k, avg=5790.48, stdev=239554.24
    clat percentiles (nsec):
     |  1.00th=[  956],  5.00th=[ 1176], 10.00th=[ 1352], 20.00th=[ 1560],
     | 30.00th=[ 1720], 40.00th=[ 1896], 50.00th=[ 2096], 60.00th=[ 2352],
     | 70.00th=[ 2736], 80.00th=[ 3472], 90.00th=[ 9408], 95.00th=[13504],
     | 99.00th=[19584], 99.50th=[21632], 99.90th=[25728], 99.95th=[27776],
     | 99.99th=[97792]
   bw (  KiB/s): min=13027, max=259658, per=17.48%, avg=80775.94, stdev=55202.71, samples=207
   iops        : min=26054, max=519318, avg=161551.88, stdev=110405.41, samples=207
  lat (nsec)   : 750=0.08%, 1000=1.52%
  lat (usec)   : 2=44.15%, 4=37.30%, 10=7.79%, 20=8.25%, 50=0.90%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=8.28%, sys=57.86%, ctx=1802, majf=0, minf=1075
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-100: (groupid=0, jobs=1): err= 0: pid=26005: Sat Jul  3 21:30:40 2021
  write: IOPS=154k, BW=75.2MiB/s (78.9MB/s)(8192MiB/108889msec); 0 zone resets
    clat (nsec): min=650, max=377904k, avg=5846.26, stdev=241931.90
     lat (nsec): min=683, max=377904k, avg=5883.24, stdev=241931.94
    clat percentiles (nsec):
     |  1.00th=[    1112],  5.00th=[    1320], 10.00th=[    1416],
     | 20.00th=[    1576], 30.00th=[    1720], 40.00th=[    1880],
     | 50.00th=[    2096], 60.00th=[    2352], 70.00th=[    2736],
     | 80.00th=[    3504], 90.00th=[    9536], 95.00th=[   13760],
     | 99.00th=[   19840], 99.50th=[   21888], 99.90th=[   25984],
     | 99.95th=[   27776], 99.99th=[11862016]
   bw (  KiB/s): min= 9539, max=298820, per=17.03%, avg=78732.40, stdev=61111.96, samples=210
   iops        : min=19079, max=597638, avg=157464.85, stdev=122223.94, samples=210
  lat (nsec)   : 750=0.01%, 1000=0.33%
  lat (usec)   : 2=45.84%, 4=36.87%, 10=7.59%, 20=8.44%, 50=0.92%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=8.34%, sys=57.43%, ctx=1846, majf=0, minf=1074
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1022MiB/s (1071MB/s), 170MiB/s-298MiB/s (179MB/s-313MB/s), io=48.0GiB (51.5GB), run=27449-48110msec
  WRITE: bw=451MiB/s (473MB/s), 75.2MiB/s-147MiB/s (78.9MB/s-155MB/s), io=48.0GiB (51.5GB), run=55553-108889msec

Disk stats (read/write):
  pmem1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%